import { Hero } from "./components";
import EnergyImage from "./assets/images/01.png";
import WaterImage from "./assets/images/01 (1).png";
import FoodImage from "./assets/images/01 (2).png";

import FeatureCard from "./components/FeatureCard";
import Footer from "./components/Footer";

import ContactForm from "./components/ContactForm";
import OurParteners from "./components/OurParteners";


const data = [
  {
    number: "00",
    title: "ما هي تحسين؟",
    subtitle:
      "تحسين هي الاولى في الشرق الأوسط في مجالات : ",
    description:
      `
       التحلية بالتقطير
      - التدوير والتغويز بالبلازما
      - الزراعات العائمة
      - تطوير جهاز إنعاش القلب الأوتوماتيكي
      `

  },
  {
    number: "01",
    title: "الأعلاف و الغذاء",
    subtitle:
      `تخصيص 100 فدان تقريبا ربع مساحة القرية لزراعة محاصيل الأعلاف
      وبدائل الأعلاف المختلفة،`,
    description:
    `مثل البنجر والبرسيم الحجازي و البونكام
    وغرف الشعير المستنبت وأحواض الأزولا وغيرها من المحاصيل التي
    توفر نسب متوازنة من البروتينات و النشويات الألياف بما يتناسب مع
    كل حيوان والمرحلة العمرية من حياته
    `
  },

  {
    number: "02",
    title: "الإقتصاد الدائري",
    subtitle:
    `الإعتماد الكامل على الطاقة النظيفة والمتجددة.`,
    description:
    `- تخزين الطاقة في الكتلة الحيوية.
    - دورة إنتاج الطاقة والطعام في القرية هي دورة متداخلة ومغلقة ولا يوجد
    فيها أي هدر
    `
  },

  {
    number: "03",
    title: "البصمة الكربونية",
    subtitle:
      `سيتم حساب كل مواد البناء التي تم استخدامها في القرية`,
    description:
      `والتي تسبب انبعاثات كربونية في تصنيعها مثل الاسمنت وغيره
      وذلك تمهيدا للغعلان رسميا عن أول قرية مصرية ذات انبعاثات كربونية تحت الصفر
      `
  },

  {
    number: "04",
    title: "التصاميم والبناء",
    subtitle:
      "تعتمد القرية في المعمار علي سياسة تقليل استخدام أي مواد بناء",
    description:
      `
      يساهم تصنيعها في انبعاثات الكربون مثل الأسمنت وحديد التسليح
      ويتم تشييد جميع المباني بالتصميمات المعمارية الخاصة بالمباني المستدامة
      
      `
  },

  {
    number: "05",
    title: "التغويز",
    subtitle:
      "هي تقنية لتحويل المتبقيات الزراعية الصلبة إلى هيدروجين أخضر بإستخدام (البلازما)",
    description:
      `أكد الدكتور ناصر مصطفى العشماوى رئيس بحوث متفرغ بمعهد بحوث الهندسة الزراعية أن تقنية
      التغويز ليست بالجديدة، فقد بدأت فى القرن التاسع عشر فى انجلترا، من خلال الأفران التى استخدمت فى
      حرق الفحم لصهر الحديد، استخدمت عملية التغويز أثناء الحرب العالمية الثانية بكثرة فى أوروبا وآسيا،
      لتوفير الوقود اللازم للسيارات وعربات النقل الثقيل والجرارات الزراعية، ولكن بعد توافر إمدادات البترول
      ومشتقاته، فقد حل الوقود السائل محل الوقود الغازى، لسهولة تداوله وتوافره بصورة أسهل.`
  },

  {
    number: "06",
    title: "التوسع في الإنتاج الحيواني",
    subtitle:
      `تعتمد القرية بشكل محوري في تأسيسها علي الإكتفاء الذاتي وبشكل كامل`
      ,
    description:
      `من مصادر الطاقة والمياة والأعلاف
      مما يؤدي إلى استدامة التوسع في الإنتاج الحيواني
      والداجني والسمكي بأنواعهم المختلفة.
      `
  },

  {
    number: "07",
    title: "الطاقة",
    subtitle:
      `يتم إنتاج الطاقة صباحا بالاعتماد على الألواح الشمسية، ومسا ء
      بإستخدام الكتلة الحيوية.`,
    description:
      `يتم إنتاج الطاقة وتخزينها في صورة الكتلة الحيوية (Biomass)،
      سواء كانت عضوية أو غير عضوية، ويتم ذلك عن طريق عملية
      التغويز (Gasification) وعملية التحلل (Pyrolysis) في غياب
      الأكسجين وبشكل صديق للبيئة، وتحويل المخلفات بأنواعها من الحالة
      الصلبة أو السائلة إلى الحالة الغازية لتشغيل مولدات الكهرباء عند
      الحاجة.`
  },

  {
    number: "08",
    title: "الماء",
    subtitle:
      `يتم تحلية مياه البحر أو مياه الابار العذبة بطريقة صديقة للبيئة، وبدون أي عوادم
      كربونية بإستخدام نظام ATFD-ZLD`,
    description:
      `للتقطير نظام وهو ،(Zero liquid Product-Agitated Thin Film Dryer)
      يقوم بفصل الملح عن الماء تماما،ً ويتم إستخدام الملح في الصناعات.
      يتم الﻹستفادة بالمياة المقطرة للإستخدام المنزلي والحيواني وكذلك لملئ الأحواض
      السمكية ذات المياه العذبة.`
  },

  // {
  //   number: "09",
  //   title: "مبادرة تحسين البصمة الكربونية تحت الصفر",
  //   subtitle:
  //     `تساهم جمهورية مصر العربية بمعدل %8.0 من إجمالي الإنبعاثات الكربونية
  //     للغلاف الجوي في العالم`,
  //   description:
  //     `وهو ما يعادل  329 مليون طن في السنة أي ما يقرب من
  //     900 الف طن في اليوم إنبعاثات كربونية مصرية للغلاف الجوي
  //      `
  // },

  {
    number: "09",
    title: "الزراعات العائمة",
    subtitle:
      "الإستزراع السمكي تحت مزارع محاصيل الاعلاف العائمة",
    description:
      `نشرت منظمة الاغذيه والزراعة للامم المتحدة عام 2017 بحثا اعتمده مركز البحوث الزراعية بدولة بنجلاديش يوضح
      كيفية عمل المزارع العائمة فوق المسطحات المائية وإنتاج مختلف المحاصيل الاستراتيجية كالارز المقاوم للملوحة.`
  },

  {
    number: "10",
    title: "جهاز إنعاش القلب",
    subtitle:
      "جهاز الإنعاش الأوتوماتيكي للقلب",
    description:
      `بعد اعلان وزارة الصحة والسكان رسميا نموذج التبرع بالاعضاء بعد الوفاه والتي بادر بالتوقيع عليها رئيس لجنة
      الصحة بمجلس النواب وغيره من السادة النواب لتحفيز المواطنين للتبرع بالأعضاء بعد الوفاه لإنقاذ حياه الاخرين.`
  },
];

const App = () => {
  return (
    <div className="Tahseen">
      <Hero />

      {data.map((card, idx) => (
        <FeatureCard {...card} key={idx} />
      ))}

      <OurParteners />
      <ContactForm />
      <Footer />

    </div>
  );
};

export default App;
